tests/mock_responses/v1/api_subscription_list.json

{
  "data": [
    {
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false
      },
      "billing_cycle_anchor": 1643577603,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1642281612,
      "current_period_end": 1643577603,
      "current_period_start": 1642281612,
      "customer": "cus_tester",
      "days_until_due": null,
      "default_payment_method": "pm_0001",
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "id": "sub_0001",
      "items": {
        "data": [
          {
            "billing_thresholds": null,
            "created": 1642281613,
            "id": "si_0001",
            "metadata": {},
            "object": "subscription_item",
            "plan": {
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1635018592,
              "currency": "usd",
              "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": "Monthly Subscription",
              "object": "plan",
              "product": "prod_KxfXRXOd7dnLbz",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1635018592,
              "currency": "usd",
              "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": "Monthly Subscription",
              "object": "price",
              "product": "prod_KxfXRXOd7dnLbz",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "quantity": 1,
            "subscription": "sub_0001",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_0001"
      },
      "latest_invoice": "in_00001",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "object": "subscription",
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "active": true,
        "aggregate_usage": null,
        "amount": 1500,
        "amount_decimal": "1500",
        "billing_scheme": "per_unit",
        "created": 1635018592,
        "currency": "usd",
        "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": "Monthly Subscription",
        "object": "plan",
        "product": "prod_KxfXRXOd7dnLbz",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1642281612,
      "status": "trialing",
      "transfer_data": null,
      "trial_end": 1643577603,
      "trial_start": 1642281612
    },
    {
      "application_fee_percent": null,
      "automatic_tax": {
        "enabled": false
      },
      "billing_cycle_anchor": 1643577603,
      "billing_thresholds": null,
      "cancel_at": null,
      "cancel_at_period_end": false,
      "canceled_at": null,
      "collection_method": "charge_automatically",
      "created": 1642281612,
      "current_period_end": 1643577603,
      "current_period_start": 1642281612,
      "customer": "cus_tester2",
      "days_until_due": null,
      "default_payment_method": "pm_0001",
      "default_source": null,
      "default_tax_rates": [],
      "discount": null,
      "ended_at": null,
      "id": "sub_0002",
      "items": {
        "data": [
          {
            "billing_thresholds": null,
            "created": 1642281613,
            "id": "si_0002",
            "metadata": {},
            "object": "subscription_item",
            "plan": {
              "active": true,
              "aggregate_usage": null,
              "amount": 1500,
              "amount_decimal": "1500",
              "billing_scheme": "per_unit",
              "created": 1635018592,
              "currency": "usd",
              "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": "Monthly Subscription",
              "object": "plan",
              "product": "prod_KxfXRXOd7dnLbz",
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1635018592,
              "currency": "usd",
              "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": "Monthly Subscription",
              "object": "price",
              "product": "prod_KxfXRXOd7dnLbz",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tax_behavior": "unspecified",
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 1500,
              "unit_amount_decimal": "1500"
            },
            "quantity": 1,
            "subscription": "sub_0001",
            "tax_rates": []
          }
        ],
        "has_more": false,
        "object": "list",
        "total_count": 1,
        "url": "/v1/subscription_items?subscription=sub_0001"
      },
      "latest_invoice": "in_00001",
      "livemode": false,
      "metadata": {},
      "next_pending_invoice_item_invoice": null,
      "object": "subscription",
      "pause_collection": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "pending_invoice_item_interval": null,
      "pending_setup_intent": null,
      "pending_update": null,
      "plan": {
        "active": true,
        "aggregate_usage": null,
        "amount": 1500,
        "amount_decimal": "1500",
        "billing_scheme": "per_unit",
        "created": 1635018592,
        "currency": "usd",
        "id": "price_1KHkCLL14ex1CGCipzcBdnOp",
        "interval": "month",
        "interval_count": 1,
        "livemode": false,
        "metadata": {},
        "nickname": "Monthly Subscription",
        "object": "plan",
        "product": "prod_KxfXRXOd7dnLbz",
        "tiers_mode": null,
        "transform_usage": null,
        "trial_period_days": null,
        "usage_type": "licensed"
      },
      "quantity": 1,
      "schedule": null,
      "start_date": 1642281612,
      "status": "trialing",
      "transfer_data": null,
      "trial_end": 1643577603,
      "trial_start": 1642281612
    }
  ],
  "has_more": false,
  "object": "list",
  "url": "/v1/subscriptions"
}